CSI API ETABS v1
eHingeLocationType Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eHingeLocationType
Public Enumeration eHingeLocationType
Dim instance As eHingeLocationType
public enum class eHingeLocationType
type eHingeLocationType
Members
Member name | Value | Description
RelativeDistance | 1
OffsetFromIEnd | 2
OffsetFromJEnd | 3
See Also
Reference
ETABSv1 Namespace